In [107]:
import pandas as pd
from operator import attrgetter
import seaborn as sns
from matplotlib import pyplot as plt
from matplotlib import colors as mcolors
import numpy as np
import scipy.stats as st
import pingouin as pg
import os
#Импортируем библиотеки

In [108]:
path_to_file1='/mnt/HC_Volume_18315164/home-jupyter/jupyter-rustam-zhanybaev-f-58cc2/Python/Finale/Проект_2_groups.csv'
path_to_file2='/mnt/HC_Volume_18315164/home-jupyter/jupyter-rustam-zhanybaev-f-58cc2/Python/Finale/Проект_2_group_add.csv'
path_to_file3='/mnt/HC_Volume_18315164/home-jupyter/jupyter-rustam-zhanybaev-f-58cc2/Python/Finale/Проект_2_active_studs.csv'
path_to_file4='/mnt/HC_Volume_18315164/home-jupyter/jupyter-rustam-zhanybaev-f-58cc2/Python/Finale/Проект_2_checks.csv'

gr1=pd.read_csv(path_to_file1, sep=';')
gr2=pd.read_csv(path_to_file2)
act=pd.read_csv(path_to_file3)
ch=pd.read_csv(path_to_file4,sep=';')
#читаем csv файлы

In [109]:
# проверяем файлы
# groups
gr1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74484 entries, 0 to 74483
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      74484 non-null  int64
 1   grp     74484 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

In [110]:
gr1.head()

     id grp
0  1489   B
1  1627   A
2  1768   B
3  1783   B
4  1794   A

In [111]:
# проверяем файлы
# group_add
gr2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      92 non-null     int64
 1   grp     92 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.6+ KB

In [112]:
gr2.head()

        id grp
0  5694584   B
1  5694830   B
2  5695057   B
3  5698872   B
4  5699067   B

In [113]:
# active_studs
act.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8341 entries, 0 to 8340
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  8341 non-null   int64
dtypes: int64(1)
memory usage: 65.3 KB

In [114]:
act.head()

   student_id
0      581585
1     5723133
2     3276743
3     4238589
4     4475369

In [115]:
ch.info()
#checks

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541 entries, 0 to 540
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  541 non-null    int64
 1   rev         541 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 8.6 KB

In [116]:
ch.head()

   student_id    rev
0        1627  990.0
1        3185  690.0
2       25973  690.0
3       26280  690.0
4      100300  990.0

In [117]:
       # Переименовываем столбцы в датафреймах
gr1=gr1.rename(columns={gr1.columns[0]:'student_id',gr1.columns[1]:'group'})
gr2=gr2.rename(columns={gr2.columns[0]:'student_id',gr2.columns[1]:'group'})
    # Объединяем и убираем дубликаты на всякий случай, хотя их нет.
union_gr = pd.concat([gr1, gr2]).drop_duplicates(subset='student_id').reset_index(drop=True)

In [118]:
union_gr

       student_id group
0            1489     B
1            1627     A
2            1768     B
3            1783     B
4            1794     A
...           ...   ...
74571   200247820     B
74572   201032527     B
74573   201067612     B
74574   201067653     B
74575   201067659     B

[74576 rows x 2 columns]

In [119]:
act['active'] = 1
# Добавил в таблицу act колонку с признаком активности.

In [120]:
act.head()

   student_id  active
0      581585       1
1     5723133       1
2     3276743       1
3     4238589       1
4     4475369       1

In [121]:
#  При слиянии таблиц будем использовать левое соединение, чтобы сохранить все строки из нашего основного датафрейма.
union_gr = union_gr.merge(act, on = 'student_id', how = 'left')

In [122]:
union_gr
#проверяем

       student_id group  active
0            1489     B     NaN
1            1627     A     1.0
2            1768     B     NaN
3            1783     B     NaN
4            1794     A     NaN
...           ...   ...     ...
74571   200247820     B     NaN
74572   201032527     B     NaN
74573   201067612     B     NaN
74574   201067653     B     NaN
74575   201067659     B     NaN

[74576 rows x 3 columns]

In [123]:
# Заполняем пропущенные значения нулями, чтобы показать отсутствие активности.
union_gr['active'] = union_gr['active'].fillna(0)

In [124]:
union_gr

       student_id group  active
0            1489     B     0.0
1            1627     A     1.0
2            1768     B     0.0
3            1783     B     0.0
4            1794     A     0.0
...           ...   ...     ...
74571   200247820     B     0.0
74572   201032527     B     0.0
74573   201067612     B     0.0
74574   201067653     B     0.0
74575   201067659     B     0.0

[74576 rows x 3 columns]

In [125]:
# при объединении checks также применяем левое соединение
union_gr = union_gr.merge(ch, on = 'student_id', how = 'left')

In [126]:
# Заполняем пропуски в столбце rev нулями, чтобы показать, что покупок не было.
union_gr['rev'] = union_gr['rev'].fillna(0)

In [127]:
union_gr
#проверяем

       student_id group  active    rev
0            1489     B     0.0    0.0
1            1627     A     1.0  990.0
2            1768     B     0.0    0.0
3            1783     B     0.0    0.0
4            1794     A     0.0    0.0
...           ...   ...     ...    ...
74571   200247820     B     0.0    0.0
74572   201032527     B     0.0    0.0
74573   201067612     B     0.0    0.0
74574   201067653     B     0.0    0.0
74575   201067659     B     0.0    0.0

[74576 rows x 4 columns]

In [128]:
tot_users=union_gr.groupby('group').student_id.count()
tot_users
#Смотрим количество студентов в каждой группе

group
A    14693
B    59883
Name: student_id, dtype: int64

Количество студентов в экспериментальной группе в четыре раза превышает контрольную. Такой значительный перекос в распределении участников может серьезно повлиять на итоги эксперимента.

Другими словами - из-за неравного размера групп мы не можем быть уверены, что наблюдаемые различия действительно вызваны воздействием, а не случайным дисбалансом в выборке.

In [129]:
non_active_buyers=union_gr.query('active == 0 & rev>0')
#Проверяем, есть ли студенты, которые не проявляли активности во время эксперимента, но купили услуги

In [130]:
non_active_buyers

       student_id group  active     rev
39           3185     B     0.0   690.0
121         25973     B     0.0   690.0
125         26280     B     0.0   690.0
223        100645     B     0.0   630.0
254        102534     B     0.0   580.0
...           ...   ...     ...     ...
72452     5291900     B     0.0   199.0
72753     5331842     B     0.0   290.0
73632     5486319     B     0.0   199.0
74049     5562806     B     0.0   398.0
74216     5599663     B     0.0  1900.0

[149 rows x 4 columns]

In [131]:
non_active_buyers['group'].value_counts()
# Проверяем, сколько неактивных во время эксперимента студентов в каждой группе совершили покупки

B    120
A     29
Name: group, dtype: int64

Студенты не могут оплатить услуги, не заходя на сайт. Расхождение в данных могло возникнуть по нескольким причинам:

Возможно, покупки были совершены уже до/после теста нового способа оплаты. Но тогда непонятно, как эти платежи попали в наши данные.

Или произошел технический сбой, который привел к ошибке в сборе информации.

Еще вариант - оплата прошла через другие платформы компании (например, мобильное приложение или наличным расчетом). Но это тоже не объясняет ситуацию, ведь новый метод оплаты тестировался только на сайте.

Чтобы точно определить причину, нужны дополнительные детали о проведении эксперимента.

Эти проблемные данные мы убрали из анализа, чтобы они не исказили итоговые результаты.

In [132]:
union_gr = union_gr[~((union_gr['active'] == 0) & (union_gr['rev'] > 0))]
union_gr
# Удаляем и проверяем

       student_id group  active    rev
0            1489     B     0.0    0.0
1            1627     A     1.0  990.0
2            1768     B     0.0    0.0
3            1783     B     0.0    0.0
4            1794     A     0.0    0.0
...           ...   ...     ...    ...
74571   200247820     B     0.0    0.0
74572   201032527     B     0.0    0.0
74573   201067612     B     0.0    0.0
74574   201067653     B     0.0    0.0
74575   201067659     B     0.0    0.0

[74427 rows x 4 columns]

# Метрики

В анализе мы ориентируемся на три ключевые метрики:

1. Конверсия в оплату (CR) - это главный показатель эффективности. Новая система оплаты создана для упрощения процесса покупки. Рост конверсии прямо покажет, насколько больше студентов стало доходить до оплаты благодаря новому методу.

2. Средний доход на пользователя (ARPU) - покажет, изменились ли траты студентов в денежном выражении. Мы поймем, стали ли пользователи в среднем платить больше после упрощения процесса оплаты.

3. Средний доход на активного пользователя (ARPAU) - эта метрика особенно важна для самых вовлеченных студентов. Если оплата действительно стала удобнее, то активные пользователи likely будут покупать чаще и на larger суммы, что отразится в росте этого показателя.

Короче говоря: смотрим на то, стало ли больше оплат (CR), увеличился ли средний чек (ARPU) и особенно - изменилось ли поведение самых активных студентов (ARPAU).

### 1. Конверсия в оплату (CR)

Гипотезы:

Нулевая гипотеза (H₀)
Разницы в конверсии между контрольной и экспериментальной группами не существует. Любые наблюдаемые различия являются случайными и обусловлены природой выборки.

Альтернативная гипотеза (H₁)
Разница в конверсии между группами статистически значима. Новая механика оплаты повлияла на поведение пользователей.

In [149]:
# Создаем колонку с признаком оплаты студентом.
union_gr['paid'] = (union_gr['rev']>0).astype(int)

/opt/tljh/user/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [134]:
union_gr
# Будем применяем тест хи-квадрат для проверки статистической значимости различий в долях оплат между контрольной и экспериментальной группами:

       student_id group  active    rev  paid
0            1489     B     0.0    0.0     0
1            1627     A     1.0  990.0     1
2            1768     B     0.0    0.0     0
3            1783     B     0.0    0.0     0
4            1794     A     0.0    0.0     0
...           ...   ...     ...    ...   ...
74571   200247820     B     0.0    0.0     0
74572   201032527     B     0.0    0.0     0
74573   201067612     B     0.0    0.0     0
74574   201067653     B     0.0    0.0     0
74575   201067659     B     0.0    0.0     0

[74427 rows x 5 columns]

In [135]:
contingency = pd.crosstab(union_gr['group'], union_gr['paid'])

In [136]:
contingency

paid       0    1
group
A      14586   78
B      59449  314

In [137]:
chi2, p, dof, expected = st.chi2_contingency(contingency)
print(f"p-value равен {p} ")
print(f"хи-квадрат равен {chi2}")

p-value равен 0.9729739774584535
хи-квадрат равен 0.0011477578945047813

Результаты статистического теста показывают, что значимых различий между группами не обнаружено.

Статистические выводы:

p-value > 0.05 → различия статистически не значимы

χ² = 0.01 → очень маленькое значение хи-квадрат

Практическая интерпретация:
Новая механика оплаты не повлияла на конверсию студентов. Показатели оплаты в экспериментальной группе практически не отличаются от контрольной.

Вывод:
Внедрение нового метода оплаты не привело к значимым изменениям в поведении студентов. Конверсия осталась на прежнем уровне, что означает отсутствие практического эффекта от нововведения.

### 2. Средний доход на пользователя (ARPU)

In [ ]:
Гипотезы:

Нулевая гипотеза (H₀)
Разницы в среднем чеке между контрольной и экспериментальной группами не существует. Любые наблюдаемые различия в ARPU являются случайными.

Альтернативная гипотеза (H₁)
Разница в среднем чеке между группами статистически значима. Новая механика оплаты повлияла на сумму покупок.

Прежде чем выбирать статистический тест, необходимо проверить ключевые предположения о данных.

Проверяем два основных условия:

Нормальность распределения - насколько данные соответствуют нормальному распределению

Равенство дисперсий - одинаковы ли разбросы данных в группах

In [138]:
Сontrol = union_gr.query("group=='A'")['rev']
Experiment = union_gr.query("group=='B'")['rev']

In [139]:
# проверяем, насколько близко данные соответствуют нормальному распределению:

In [140]:
# контрольная группа
st.normaltest(Сontrol)

NormaltestResult(statistic=36485.34095373771, pvalue=0.0)

In [141]:
# экспериментальная группа
st.normaltest(Experiment)

NormaltestResult(statistic=126827.7390674531, pvalue=0.0)

P-value в обеих группах меньше 0.05, что указывает на ненормальное распределение данных.

Статистический вывод:

Контрольная группа: p-value < 0.05 → распределение не нормальное

Экспериментальная группа: p-value < 0.05 → распределение не нормальное

In [142]:
# проверяем, одинаков ли разброс данных в контрольной и экспериментальной группах:

In [143]:
st.levene(Control, Experiment)

LeveneResult(statistic=2.8755514828907476, pvalue=0.08993834382378618)

P-value превышает 0.05, поэтому мы принимаем нулевую гипотезу о том, что разброс данных в обеих группах статистически одинаков.

Поскольку размер каждой выборки больше 30 наблюдений, мы можем полагаться на центральную предельную теорему. Это означает, что даже при ненормальном распределении выручки, распределение средних значений будет приближаться к нормальному.

Таким образом, мы можем использовать t-тест Стьюдента для сравнения среднего чека между группами, так как основные требования для его применения выполнены: равенство дисперсий и достаточный объем выборок.

In [150]:
st.ttest_ind(Сontrol, Experiment)

Ttest_indResult(statistic=-1.6957451114158482, pvalue=0.08993834382409223)

Результаты t-теста показывают отсутствие статистически значимых различий в среднем чеке между группами.

Статистические выводы:

p-value = 0.08 > 0.05 → не отвергаем нулевую гипотезу

t-статистика = -1.69 → небольшое отклонение средних значений

Практическая интерпретация:
Новая механика оплаты не повлияла на сумму покупок студентов. Средний чек в экспериментальной группе не отличается от контрольной.

Итоговый вывод:
Изменение метода оплаты не привело к увеличению или уменьшению среднего чека. Студенты в обеих группах платили примерно одинаковые суммы, что свидетельствует об отсутствии финансового эффекта от нововведения.

### 3. Средний доход на активного пользователя (ARPAU)

Гипотезы:

Нулевая гипотеза (H₀)
Разницы в среднем чеке активных пользователей между контрольной и экспериментальной группами не существует. Любые наблюдаемые различия в ARPAU являются случайными.

Альтернативная гипотеза (H₁)
Разница в среднем чеке активных пользователей между группами статистически значима. Новая механика оплаты повлияла на сумму покупок наиболее вовлеченных студентов.

Прежде чем выбирать статистический тест, необходимо также проверить ключевые предположения о данных.

Проверяем два основных условия:

Нормальность распределения - насколько данные соответствуют нормальному распределению

Равенство дисперсий - одинаковы ли разбросы данных в группах

In [151]:
arpau = union_gr.query("active == 1")
# Отбираем только активных студентов для анализа.

In [152]:
arpau

       student_id group  active    rev  paid
1            1627     A     1.0  990.0     1
10           2085     B     1.0    0.0     0
12           2215     B     1.0    0.0     0
43           3391     A     1.0    0.0     0
45           3401     B     1.0    0.0     0
...           ...   ...     ...    ...   ...
74543     5760471     B     1.0    0.0     0
74545     5777081     B     1.0    0.0     0
74558     5870856     A     1.0    0.0     0
74561     5945085     B     1.0    0.0     0
74562     5951797     B     1.0    0.0     0

[8341 rows x 5 columns]

In [158]:
arpau_c = arpau.query("group == 'A'")['rev']
arpau_e = arpau.query("group == 'B'")['rev']
# проверяем, насколько близко данные соответствуют нормальному распределению:

In [159]:
st.normaltest(arpau_c)
#контрольная группа

NormaltestResult(statistic=2240.595797407402, pvalue=0.0)

In [160]:
st.normaltest(arpau_e)
# экспериментальная группа

NormaltestResult(statistic=7797.399211581946, pvalue=0.0)

P-value в обеих группах меньше 0.05, что указывает на ненормальное распределение данных.

Статистический вывод:

Контрольная группа: p-value < 0.05 → распределение не нормальное

Экспериментальная группа: p-value < 0.05 → распределение не нормальное

In [161]:
# проверяем, одинаков ли разброс данных в контрольной и экспериментальной группах:
st.levene(arpau_c, arpau_e)

LeveneResult(statistic=1.501460829433639, pvalue=0.22048133327049665)

Статистическое обоснование:

P-value > 0.05 → дисперсии равны

Объем выборок активных пользователей > 30 → работает центральная предельная теорема

Можно использовать t-тест, несмотря на ненормальность распределения

In [162]:
st.ttest_ind(arpau_c, arpau_e)

Ttest_indResult(statistic=-1.2253411073793445, pvalue=0.22048133326988378)

Согласно результатам анализа, статистически значимых различий в среднем чеке активных студентов между группами не обнаружено.

Статистический вывод:

p-value > 0.05 → не отвергаем нулевую гипотезу

Различия в ARPAU между группами не являются статистически значимыми.

# Итог:

По итогам анализа A/B-теста внедрение нового механизма оплаты не продемонстрировало ожидаемого эффекта: изменения в конверсии и среднем чеке не зафиксированы.

При этом в эксперименте наблюдался дисбаланс распределения выборки и выявлены ошибки в данных, что может влиять на корректность выводов.

Рекомендуется провести повторную проверку данных и дополнительные исследования. До получения более надёжных результатов запуск нового механизма оплаты лучше отложить.